app/views/articles/_form.html.erb

    <%= f.label "Categories" %><br />
    <% Category.all.each do |category| %>
      <%= check_box_tag 'article[category_ids][]', category.id,
        @article.category_ids.include?(category.id), id: dom_id(category) %>
---
SELECT "categories".* FROM "categories"   ORDER BY categories.name
SELECT "categories".id FROM "categories" INNER JOIN "articles_categories" ON "categories"."id" = "articles_categories"."category_id" WHERE "articles_categories"."article_id" = ?  ORDER BY categories.name  [["article_id", 1]]