app/controllers/articles_controller.rb

  def index
    @articles = Article.all.paginate(:page => params[:page], :per_page => 4)
---
SELECT "articles".* FROM "articles"

  def show
    @commentsShow = @article.comments.paginate(:page => params[:page], :per_page => 4)
---
SELECT "comments".* FROM "comments"  WHERE "comments"."article_id" = ?  [["article_id", 1]]

  def edit
    @article = current_user.articles.find(params[:id])
---
SELECT  "articles".* FROM "articles"  WHERE "articles"."user_id" = ? AND "articles"."id" = ?  ORDER BY published_at DESC, title ASC LIMIT 1  [["user_id", 1], ["id", 1]]

  def create
    @article = current_user.articles.new(article_params)

    respond_to do |format|
      if @article.save
---
INSERT INTO "articles" ("body", "created_at", "published_at", "title", "updated_at") VALUES (?, ?, ?, ?, ?)

  def update
    @article = current_user.articles.find(params[:id])
    respond_to do |format|
      if @article.update(article_params)
---
SELECT  "articles".* FROM "articles"  WHERE "articles"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "articles" SET "excerpt" = ?, "location" = ?, "title" = ?, "updated_at" = ? WHERE "articles"."id" = 1  [["excerpt", ""], ["location", ""], ["title", "First Article Edited"], ["updated_at", "2015-12-04 13:46:57.382697"]]