app/controllers/comments_controller.rb

INSERT INTO "comments" ("article_id", "body", "created_at", "email", "name", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["article_id", 1], ["body", "This is a comment"], ["created_at", "2015-12-04 14:06:50.113935"], ["email", "aa.moore@ulster.ac.uk"], ["name", "Adrian"], ["updated_at", "2015-12-04 14:06:50.113935"]]
---
  def create
    @comment = @article.comments.new(comment_params)
    if @comment.save

SELECT  "articles".* FROM "articles"  WHERE "articles"."id" = ? LIMIT 1  [["id", 1]]
---
  def load_article
    @article = Article.find(params[:article_id])