app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("created_at", "email", "hashed_password", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2015-12-04 13:52:32.174081"], ["email", "newperson@user.com"], ["hashed_password", "5baa61e4c9b93f3f0682250b6cf8331b7ee68fd8"], ["updated_at", "2015-12-04 13:52:32.174081"]]